public class C01_DataType {
    public static void main(String[] args) {
        // 데이터타입
        // bit < 4bit(Nibble) < 8bit 1byte < 16Bit 2byte
        // 변수에 타입지정 논리형(boolean 1byte) 바이트(1byte) 문자(2Byte) 정수(1byte) short(2bytes) int(4bytes) long()   실수 문자열

        // 65536 32768 16384 8192 4096 2048 1024 512 256 128 64 32 16 8 4 2 1

        // 표현범위 -2(n-1) ~ 2(n-1)-1
        // 8bit의 표현범위 -128 ~ 127
        // n=8
        // -2(8-1) ~ 2(8-1)-1
        // -2^7 ~ 2^7-1
        // 10진수 최대수(n-1 > 10-1 > 9) 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20.......
        // 16진수 최대수(n-1 > 16-1 > 15) 0 1 2 3 4 5 6 7 8 9 A(10) B(11) C(12) D(13) E(14) F(15) 11 12 13 14 15 16.......
        // 8진수 최대수(n-1 > 8-1 > 7) 0 1 2 3 4 5 6 7 10 11 12 13 14 15 16 17 20 
        


        // 2진수
        // 전원 켠다 on(1), 끈다(0)
        // 전원스위치가 0개이면 표현방법은 1가지
        // 전원스위치가 1개이면 표현방법은 2가지 (on/off)
        // 사람이 사용하는 10진수 주 ㅇ가장 작은 수 0(zero)을 off로 표현하고 1을 on 상태로 표현
        // 0 과 1  2진수 bit => Binary Term
        // 45 101101

        // 문제 1) 0101 1101(2)를 4진수로 1131
        // 문제 2) 13(4)를 2진수로 01 11
        // 문제 3) 3213(4)를 2진수로 11 10 01 11
        // 문제 4) 1101 1101(2)를 4진수로 3131
        
        // 문제 1) 173 (8) > 0111 1011 (2)
        // 문제 2) 11011110101010 (2) > 33652 (8)
        // 문제 2) 7546 (8) > 111 101 100 110 (2)
        
        // 문제 1) 173A(hex) > 0001 0111 0011 1010(2)
        // 문제 2) CB89(hex) > 1100 1011 1000 1001(2)

        // 문제 1) 126(10) > 0111 1110
        // 문제 1) 1011011(2) > 91



    }
}
